We are going to see how to make an operations between different dataframes.

In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"], 
           "Spor" : ["Koşu", "Yüzme","Koşu","Basketbol"],
          "Kalori" : [100,200,300,400]
          }

In [4]:
dataFrame1 = pd.DataFrame(dict1,index = [0,1,2,3])

In [5]:
dict2 = {"Isim" : ["Osman","Levent","Atlas","Fatma"], 
           "Spor" : ["Koşu", "Yüzme","Koşu","Basketbol"],
          "Kalori" : [200,100,50,300]
          }
dataFrame2 = pd.DataFrame(dict2,index = [4,5,6,7])

In [6]:
dict3 = {"Isim" : ["Ayse","Mahmut","Duygu","Nur"], 
           "Spor" : ["Koşu", "Yüzme","Badminton","Tenis"],
          "Kalori" : [300,400,500,250]
          }
dataFrame3 = pd.DataFrame(dict3,index=[8,9,10,11])

### concatenation

In [7]:
pd.concat([dataFrame1,dataFrame2,dataFrame3])

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8     Ayse       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

In [8]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=1)

,Isim,Spor,Kalori,Isim,Spor,Kalori,Isim,Spor,Kalori
0,Ahmet,Koşu,100.0,NaN,NaN,NaN,NaN,NaN,NaN
1,Mehmet,Yüzme,200.0,NaN,NaN,NaN,NaN,NaN,NaN
2,Zeynep,Koşu,300.0,NaN,NaN,NaN,NaN,NaN,NaN
3,Atıl,Basketbol,400.0,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,Osman,Koşu,200.0,NaN,NaN,NaN
5,NaN,NaN,NaN,Levent,Yüzme,100.0,NaN,NaN,NaN
6,NaN,NaN,NaN,Atlas,Koşu,50.0,NaN,NaN,NaN
7,NaN,NaN,NaN,Fatma,Basketbol,300.0,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,Ayse,Koşu,300.0
9,NaN,NaN,NaN,NaN,NaN,NaN,Mahmut,Yüzme,400.0
10,NaN,NaN,NaN,NaN,NaN,NaN,Duygu,Badminton,500.0
11,NaN,NaN,NaN,NaN,NaN,NaN,Nur,Tenis,250.0

### merge

In [12]:
mergeDict1 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
               "Spor" : ["Koşu","Yüzme","Koşu", "Basketbol"]
               }
mergeDataFrame1 = pd.DataFrame(mergeDict1)
mergeDataFrame1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [13]:
mergeDict2 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
               "Kalori" : [100,200,150,250]
               }
mergeDataFrame2 = pd.DataFrame(mergeDict2)
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     150
3    Atıl     250

In [15]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     150
3    Atıl  Basketbol     250

## unique

In [17]:
salaryDict = {"Isim" : ["Atıl","Zeynep","Mehmet","Ahmet"], 
             "Departman" : ["Yazılım","Satış","Pazarlama","Yazılım"],
              "Maas" : [200,300,400,500]
             }
salaryDataFrame=pd.DataFrame(salaryDict)
salaryDataFrame

     Isim  Departman  Maas
0    Atıl    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [19]:
salaryDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

## nunique

In [21]:
salaryDataFrame["Departman"].nunique()

3

## value_counts

In [22]:
salaryDataFrame["Departman"].value_counts()

Yazılım      2
Pazarlama    1
Satış        1
Name: Departman, dtype: int64

## apply

In [23]:
def bruttenNete(maas):
    return maas*0.66

In [24]:
salaryDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

## isNull

In [25]:
salaryDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

## pivot table

In [26]:
yeniBirVeri = {"Karakter Sınıfı" : ["South Park", "South Park", "Simpson", "Simpson","Simpson"],
              "Karakter Ismi" : ["Cartman", "Kenny", "Homer", "Bart","Bart"],
               "Karakter Yas" : [9,10,50,20,10]
              }
karakterDF = pd.DataFrame(yeniBirVeri)

In [27]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [28]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıfı", "Karakter Ismi"],aggfunc=np.sum)

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10